Creates a new parameter definition using specified options.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public Definition Create(
	ExternalDefinitonCreationOptions option
)
  Visual Basic
Public Function Create ( _
	option As ExternalDefinitonCreationOptions _
) As Definition
  Visual C++
public:
Definition^ Create(
	ExternalDefinitonCreationOptions^ option
)
 Parameters
  option
 Type:  Autodesk.Revit.DB ExternalDefinitonCreationOptions
 The options used to create the new parameter definition.
 Return Value
 If successful a reference to the new parameter definition is returned, otherwise    a null reference (  Nothing  in Visual Basic)  .
 Remarks
 This method only supports creation of new external definitions (shared parameters).
 See Also
  Definitions Class
  Create Overload
  Autodesk.Revit.DB Namespace